Tekla Open API Reference for Tekla Structures 2025
Distance Methods
The Distance type exposes the following members.
Methods
Name | Description
PointToLine
 Returns the distance between the given point and line.
PointToLineSegment
 Returns the distance between the given point and line segment.
PointToPlane
 Returns the distance between the given point and plane.
PointToPoint
 Returns the distance between the given two points.
Top
See Also
Reference
Distance Class
Tekla.Structures.Geometry3d Namespace